app/views/posts/index.html.erb


								<% if post.post_images.present? %>
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC