app/controllers/posts_controller.rb

  def index
    if params[:category_name]
      @posts = Post.where(:category_name => params[:category_name]).order("created_at DESC").page(params[:page]).per(8)
    else
      @posts = Post.all.order("created_at DESC").page(params[:page]).per(8)
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Probni Post 1"], ["description", "Neki text za probni post"], ["created_at", "2015-11-01 00:05:44.921039"], ["updated_at", "2015-11-01 00:05:44.921039"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["image_file_name", "slide2.jpg"], ["image_file_size", 775936], ["image_updated_at", "2015-11-03 17:54:51.320968"], ["updated_at", "2015-11-03 17:54:52.384302"], ["id", 1]]

  def find_posts
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]